In [12]:
import pandas as pd

In [16]:
df = pd.DataFrame({'col1' : [1,2,3,4,5],
             'col2' : [45,56,67,34,34],
             'col3' : 'sudhanshu kumar krish ineuron one'.split()
             })

In [17]:
"sudhanshu kumar krish ineuron one".split()

['sudhanshu', 'kumar', 'krish', 'ineuron', 'one']

In [18]:
df

   col1  col2       col3
0     1    45  sudhanshu
1     2    56      kumar
2     3    67      krish
3     4    34    ineuron
4     5    34        one

In [19]:
df['col4'] = df['col1']**2

In [20]:
df

   col1  col2       col3  col4
0     1    45  sudhanshu     1
1     2    56      kumar     4
2     3    67      krish     9
3     4    34    ineuron    16
4     5    34        one    25

In [21]:
df['col5'] = df['col3'].str[0]

In [22]:
df

   col1  col2       col3  col4 col5
0     1    45  sudhanshu     1    s
1     2    56      kumar     4    k
2     3    67      krish     9    k
3     4    34    ineuron    16    i
4     5    34        one    25    o

In [29]:
def test(a): 
    return a**2

In [57]:
df['col4_4'] = df['col1'].apply(test)

In [58]:
df

   col1  col2       col3  col4 col5 col6  col4_4
0     1    45  sudhanshu     1    s    s       1
1     2    56      kumar     4    z    z       4
2     3    67      krish     9    z    z       9
3     4    34    ineuron    16    z    z      16
4     5    34        one    25    z    z      25

In [70]:
def test1(a):
    if a =='s':
        return 's'
    else:
        return 'z'

In [77]:
df['col6_6'] = df['col5'].apply(test1)

In [78]:
df

   col1  col2       col3  col4 col5 col6  col4_4 col6_6
0     1    45  sudhanshu     1    s    s       1      s
1     2    56      kumar     4    z    z       4      z
2     3    67      krish     9    z    z       9      z
3     4    34    ineuron    16    z    z      16      z
4     5    34        one    25    z    z      25      z

In [75]:
df['col6_6'] = df['col5'].apply(lambda a: 's' if a == 's' else 'z')

In [76]:
df

   col1  col2       col3  col4 col5 col6  col4_4 col6_6
0     1    45  sudhanshu     1    s    s       1      s
1     2    56      kumar     4    z    z       4      z
2     3    67      krish     9    z    z       9      z
3     4    34    ineuron    16    z    z      16      z
4     5    34        one    25    z    z      25      z

In [79]:
df['col7']=df['col3'].apply(len)

In [80]:
df

   col1  col2       col3  col4 col5 col6  col4_4 col6_6  col7
0     1    45  sudhanshu     1    s    s       1      s     9
1     2    56      kumar     4    z    z       4      z     5
2     3    67      krish     9    z    z       9      z     5
3     4    34    ineuron    16    z    z      16      z     7
4     5    34        one    25    z    z      25      z     3

In [81]:
import math

In [82]:
df['col8']=df['col2'].apply(math.log)

In [83]:
df

   col1  col2       col3  col4 col5 col6  col4_4 col6_6  col7      col8
0     1    45  sudhanshu     1    s    s       1      s     9  3.806662
1     2    56      kumar     4    z    z       4      z     5  4.025352
2     3    67      krish     9    z    z       9      z     5  4.204693
3     4    34    ineuron    16    z    z      16      z     7  3.526361
4     5    34        one    25    z    z      25      z     3  3.526361

In [84]:
#numpy
import numpy as np

In [85]:
l = ["sudh", 1,2,3,4]

In [86]:
type(l)

list

In [88]:
type(np.array(l))

numpy.ndarray

In [98]:
a1=np.array([3,4,5,6,3.0])

In [93]:
a = np.array([[1,2], [3,4]])

In [94]:
a

array([[1, 2],
       [3, 4]])

In [95]:
a[1][1]

4

In [99]:
a1

array([3., 4., 5., 6., 3.])

In [100]:
a1[1]

4.0

In [102]:
a2=np.array([1,2,3,4], ndmin = 4)

In [105]:
a2[0][0][0][0]

1

In [106]:
a

array([[1, 2],
       [3, 4]])

In [110]:
np.asarray([1,2,3,4,5])

array([1, 2, 3, 4, 5])

In [108]:
np.asanyarray([1,2,3,4,5])

array([1, 2, 3, 4, 5])

In [109]:
np.mat([1,2,3,4,5])

matrix([[1, 2, 3, 4, 5]])

In [111]:
a=[1,2,3,4,5]
np.asarray(a)

array([1, 2, 3, 4, 5])

In [112]:
np.mat(a)

matrix([[1, 2, 3, 4, 5]])

In [113]:
np.asanyarray(a)

array([1, 2, 3, 4, 5])

In [115]:
np.asanyarray(np.mat(a))

matrix([[1, 2, 3, 4, 5]])

In [116]:
np.fromfunction(lambda i, j : i==j, (3,3))

array([[ True, False, False],
       [False,  True, False],
       [False, False,  True]])

In [123]:
np.fromfunction(lambda i,j,z,p : i*j*z*p, (4,3,2,2),dtype=int)

array([[[[0, 0],
         [0, 0]],

        [[0, 0],
         [0, 0]],

        [[0, 0],
         [0, 0]]],


       [[[0, 0],
         [0, 0]],

        [[0, 0],
         [0, 1]],

        [[0, 0],
         [0, 2]]],


       [[[0, 0],
         [0, 0]],

        [[0, 0],
         [0, 2]],

        [[0, 0],
         [0, 4]]],


       [[[0, 0],
         [0, 0]],

        [[0, 0],
         [0, 3]],

        [[0, 0],
         [0, 6]]]])

In [128]:
a = np.fromfunction(lambda i,j,z : i*j*z, (4,3,2),dtype=int)

In [129]:
a

array([[[0, 0],
        [0, 0],
        [0, 0]],

       [[0, 0],
        [0, 1],
        [0, 2]],

       [[0, 0],
        [0, 2],
        [0, 4]],

       [[0, 0],
        [0, 3],
        [0, 6]]])

In [130]:
a.ndim

3

In [131]:
a.size

24

In [132]:
a.shape

(4, 3, 2)

In [133]:
a.dtype

dtype('int32')

In [134]:
a

array([[[0, 0],
        [0, 0],
        [0, 0]],

       [[0, 0],
        [0, 1],
        [0, 2]],

       [[0, 0],
        [0, 2],
        [0, 4]],

       [[0, 0],
        [0, 3],
        [0, 6]]])

In [174]:
pd.DataFrame(a)

   0  1
0  1  2
1  3  4

In [175]:
a = np.fromfunction(lambda i , j : i*j , (400,100),dtype = int)

In [176]:
a

array([[    0,     0,     0, ...,     0,     0,     0],
       [    0,     1,     2, ...,    97,    98,    99],
       [    0,     2,     4, ...,   194,   196,   198],
       ...,
       [    0,   397,   794, ..., 38509, 38906, 39303],
       [    0,   398,   796, ..., 38606, 39004, 39402],
       [    0,   399,   798, ..., 38703, 39102, 39501]])

In [177]:
pd.DataFrame(a)

,0,1,2,3,4,5,6,7,8,9,...,90,91,92,93,94,95,96,97,98,99
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,0,1,2,3,4,5,6,7,8,9,...,90,91,92,93,94,95,96,97,98,99
2,0,2,4,6,8,10,12,14,16,18,...,180,182,184,186,188,190,192,194,196,198
3,0,3,6,9,12,15,18,21,24,27,...,270,273,276,279,282,285,288,291,294,297
4,0,4,8,12,16,20,24,28,32,36,...,360,364,368,372,376,380,384,388,392,396
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
395,0,395,790,1185,1580,1975,2370,2765,3160,3555,...,35550,35945,36340,36735,37130,37525,37920,38315,38710,39105
396,0,396,792,1188,1584,1980,2376,2772,3168,3564,...,35640,36036,36432,36828,37224,37620,38016,38412,38808,39204
397,0,397,794,1191,1588,1985,2382,2779,3176,3573,...,35730,36127,36524,36921,37318,37715,38112,38509,38906,39303
398,0,398,796,1194,1592,1990,2388,2786,3184,3582,...,35820,36218,36616,37014,37412,37810,38208,38606,39004,39402
399,0,399,798,1197,1596,1995,2394,2793,3192,3591,...,35910,36309,36708,37107,37506,37905,38304,38703,39102,39501

In [136]:
np.random.rand(100,4)

array([[9.57715931e-04, 2.30814083e-02, 5.68529742e-01, 3.03083786e-01],
       [5.80062213e-01, 9.27482193e-01, 5.13594861e-01, 7.13631419e-01],
       [5.61003185e-01, 6.35675075e-01, 3.78930522e-02, 6.31504688e-01],
       [1.56913912e-01, 7.68496326e-01, 4.13292743e-01, 9.05216434e-01],
       [9.16507015e-01, 1.17441248e-01, 9.11086365e-01, 1.35949766e-01],
       [3.56690902e-02, 5.66714738e-02, 3.04715772e-01, 5.25605371e-01],
       [3.23526096e-01, 4.43710715e-01, 8.36408503e-01, 7.94435800e-01],
       [3.97738044e-01, 8.52551867e-01, 1.18271258e-02, 9.17674432e-01],
       [1.01973011e-01, 1.80109232e-01, 2.40363330e-01, 1.66846759e-01],
       [5.19931706e-01, 7.02156595e-01, 3.41725723e-01, 7.37878360e-01],
       [7.59255172e-01, 2.41905919e-01, 4.87424304e-01, 6.76773153e-01],
       [5.32447215e-02, 7.80353636e-01, 4.92140897e-01, 8.38213680e-01],
       [5.23872393e-01, 9.89190871e-01, 4.18088535e-01, 6.24914004e-01],
       [9.94935502e-02, 6.13723811e-01, 6.36859921e-01, 1.79874518e-01],
       [7.51266318e-01, 7.09233611e-01, 1.22710777e-01, 1.69661785e-01],
       [7.19583089e-01, 1.31838682e-02, 7.80198895e-01, 2.97803103e-01],
       [4.41172588e-01, 8.46772649e-01, 3.17201918e-01, 3.05125875e-01],
       [2.99975331e-01, 5.67244392e-01, 8.70346266e-01, 5.59572217e-01],
       [1.04244298e-01, 7.72538350e-01, 2.29446326e-01, 8.53365382e-01],
       [9.58431468e-01, 4.26156134e-01, 2.27652544e-01, 8.35643277e-02],
       [4.94703683e-01, 2.86429202e-01, 6.59081216e-01, 7.17820864e-01],
       [1.06809637e-01, 2.88114379e-01, 8.55333701e-01, 4.43431333e-01],
       [4.21489970e-01, 4.63503485e-02, 4.08593517e-01, 9.48001798e-01],
       [1.80697224e-01, 8.13668913e-01, 9.16971068e-02, 2.69863114e-01],
       [4.51387079e-01, 4.52599778e-01, 4.72950681e-01, 6.24737331e-01],
       [9.59068813e-01, 6.83278477e-01, 5.85452655e-01, 4.26797356e-01],
       [1.78058715e-01, 9.31479091e-01, 1.80562299e-01, 3.73078633e-01],
       [1.02097344e-01, 6.55082224e-01, 1.20796642e-01, 5.30500903e-01],
       [7.58795415e-01, 1.88329376e-01, 4.55400430e-01, 4.57754913e-01],
       [4.01466229e-01, 7.11560261e-01, 4.88837710e-01, 1.35778590e-01],
       [5.79515454e-01, 1.85572224e-01, 2.87080514e-01, 5.78437340e-01],
       [5.16971426e-01, 4.91328317e-01, 2.95970941e-01, 6.56118620e-01],
       [5.47943122e-01, 3.11140290e-01, 6.24030628e-01, 1.55336196e-01],
       [3.86607061e-01, 4.55977150e-02, 3.44346823e-01, 9.55801477e-01],
       [1.76077799e-01, 8.39036023e-01, 4.05381879e-01, 2.00303605e-01],
       [2.27221166e-01, 3.86305517e-01, 9.92119690e-01, 6.06516781e-01],
       [1.38385111e-01, 9.76413049e-01, 1.38025095e-02, 9.91992362e-01],
       [1.38325769e-01, 3.77077846e-01, 6.48290676e-01, 4.92979597e-01],
       [5.54893314e-01, 1.49887960e-01, 9.85618582e-01, 8.10277641e-02],
       [5.56256725e-02, 8.70258961e-02, 9.83367501e-01, 5.17566179e-01],
       [7.83461605e-02, 4.08430787e-01, 4.63207450e-01, 3.89990534e-02],
       [9.20442729e-01, 2.47903767e-01, 8.65142799e-01, 9.53731697e-01],
       [8.39701665e-01, 5.85428231e-01, 5.52279771e-01, 1.06282468e-01],
       [7.53167869e-01, 2.65436433e-01, 1.23201186e-01, 7.90937313e-02],
       [8.69996350e-02, 8.23004294e-01, 4.08557931e-01, 5.00533671e-01],
       [8.40454310e-01, 1.84073077e-01, 7.95862029e-01, 7.04511387e-01],
       [6.18234708e-01, 5.81613608e-01, 6.53077971e-01, 1.40842859e-01],
       [9.21560121e-01, 2.85763549e-01, 1.79752091e-01, 4.27999740e-01],
       [9.93096600e-01, 8.52476435e-01, 2.72069246e-01, 8.81919738e-02],
       [8.33058646e-01, 5.37233695e-01, 6.36575316e-03, 1.00388257e-01],
       [6.79799918e-01, 8.79959908e-01, 5.49330466e-01, 5.11385529e-01],
       [5.39535299e-01, 2.32212766e-01, 6.72771408e-02, 7.01974076e-02],
       [8.49708996e-01, 7.45613704e-01, 5.68321839e-01, 8.42222938e-01],
       [8.44951278e-01, 8.05472713e-02, 4.73184146e-01, 5.43305677e-01],
       [8.06044032e-01, 1.04418855e-01, 6.66158656e-02, 2.36072996e-01],
       [7.85377742e-01, 3.20238383e-01, 7.27239597e-01, 1.48999742e-01],
       [9.77164572e-01, 4.22048265e-01, 8.14218518e-04, 6.20921173e-01],
       [5.58085476e-01, 1.87205661e-01, 6.07049556e-01, 2.94148287e-01],
       [9.06053173e-01, 1.53338543e-01, 5.96811218e-01, 2.16162539e-01],
       [2.04357958e-01, 5.69070079e-01, 1.74283682e-01, 7.11818535e-01],
       [3.18811594e-01, 5.49866954e-01, 7.21375810e-01, 3.24656144e-01],
       [4.30458198e-01, 3.62040028e-01, 1.61838716e-02, 4.18962688e-01],
       [5.66310836e-01, 6.90214421e-01, 3.82725106e-01, 4.48988033e-01],
       [8.47596704e-02, 3.06482709e-01, 9.87403570e-02, 3.56036882e-02],
       [9.52261742e-01, 2.50403804e-01, 7.29042017e-03, 4.35244753e-01],
       [5.86880110e-01, 3.90998289e-01, 3.92652164e-01, 1.69303662e-01],
       [6.94024863e-01, 4.27421343e-01, 1.79317946e-01, 7.60442640e-05],
       [9.69315345e-01, 8.76427775e-01, 7.37640714e-02, 6.96665955e-02],
       [3.78331670e-01, 4.44736790e-02, 3.10152301e-01, 5.86046334e-01],
       [2.93228249e-01, 4.54882812e-01, 1.97055930e-01, 7.01574105e-01],
       [8.41392727e-01, 5.08173331e-01, 7.11560676e-01, 8.40178310e-01],
       [2.56216964e-01, 3.22762560e-01, 8.90321151e-01, 3.29241813e-01],
       [3.38041804e-01, 6.00072404e-01, 8.81443938e-01, 8.29099387e-01],
       [9.59472718e-01, 8.24339651e-01, 8.30614092e-01, 3.29534070e-01],
       [7.14796957e-01, 9.93332702e-01, 7.97067603e-01, 5.15798882e-01],
       [2.11799320e-01, 8.60351217e-01, 3.55579827e-01, 3.01127169e-01],
       [4.57883629e-02, 2.01343890e-01, 1.73951567e-01, 2.90217405e-01],
       [1.82852351e-01, 5.07500346e-01, 3.28202258e-01, 9.33882636e-01],
       [7.24646583e-01, 4.53179448e-01, 3.85992068e-01, 2.02295710e-01],
       [1.03037581e-01, 9.39950335e-02, 5.73780264e-02, 7.69016231e-01],
       [8.04891891e-01, 7.88320528e-02, 5.95376260e-01, 3.44228568e-01],
       [7.04656573e-01, 8.74413768e-01, 3.54778898e-01, 2.57869306e-01],
       [3.31725701e-01, 5.12985608e-01, 9.02696398e-01, 6.20061426e-01],
       [1.47308618e-01, 3.15291303e-02, 8.28699367e-01, 2.26511454e-01],
       [5.10509306e-01, 4.66472704e-01, 5.42479678e-01, 3.40467508e-01],
       [7.20191268e-01, 4.70709092e-01, 7.70679618e-01, 1.71533463e-01],
       [5.42047009e-01, 3.04806238e-01, 3.84387988e-02, 9.06363177e-01],
       [2.66664330e-01, 4.64092910e-01, 5.96330051e-01, 8.68243834e-02],
       [2.78678723e-01, 2.18280244e-02, 8.99807347e-01, 7.57845502e-01],
       [2.98508373e-02, 1.37995315e-01, 5.57850665e-01, 7.45971740e-01],
       [8.51374583e-01, 5.30123669e-01, 4.36611705e-01, 4.35359149e-01],
       [3.74507911e-01, 5.34282237e-01, 8.55743198e-01, 1.12221617e-01],
       [9.36779552e-02, 9.72084885e-01, 2.27329653e-01, 1.28483686e-01],
       [8.35380535e-01, 2.93443160e-01, 9.81285033e-01, 2.42373964e-01],
       [8.70568408e-01, 2.27101335e-01, 8.14068637e-01, 2.86513540e-01],
       [1.40543143e-01, 4.52187475e-01, 6.38503282e-01, 2.82857550e-01],
       [2.53691374e-01, 5.15174313e-01, 8.92505482e-01, 1.13234722e-01],
       [2.51013125e-01, 2.31790990e-01, 3.91827947e-01, 6.29096264e-01],
       [4.44116818e-02, 6.49752390e-01, 1.52868311e-01, 5.18731621e-01],
       [7.14066676e-01, 6.59732315e-01, 8.37080068e-01, 2.37867473e-01]])

In [180]:
np.random.randint(4,50)

25

In [141]:
pd.DataFrame(np.random.randn(4,5))

          0         1         2         3         4
0  0.411218  0.718786  0.538871  1.398331  1.284822
1 -0.491802  1.753479  0.159552 -1.006344 -0.694916
2  1.278515  2.446091 -0.464376  0.982411 -0.189482
3 -0.420620  0.156098  0.308766  1.671580 -0.309304

In [146]:
list(range(4,10.5,2))

TypeError: 'float' object cannot be interpreted as an integer

In [148]:
a1 = np.arange(4,10.5,.2)

In [149]:
a1

array([ 4. ,  4.2,  4.4,  4.6,  4.8,  5. ,  5.2,  5.4,  5.6,  5.8,  6. ,
        6.2,  6.4,  6.6,  6.8,  7. ,  7.2,  7.4,  7.6,  7.8,  8. ,  8.2,
        8.4,  8.6,  8.8,  9. ,  9.2,  9.4,  9.6,  9.8, 10. , 10.2, 10.4])

In [150]:
a1[1:4]

array([4.2, 4.4, 4.6])

In [151]:
arr = np.random.rand(4,5)

In [152]:
arr

array([[0.09804985, 0.98064312, 0.02512852, 0.63303453, 0.39451504],
       [0.46820709, 0.82456065, 0.39811887, 0.63424821, 0.81338589],
       [0.75485666, 0.12405724, 0.48094819, 0.36639965, 0.30594077],
       [0.1804678 , 0.23313354, 0.12520383, 0.61511144, 0.88110521]])

In [153]:
arr[arr> .5]

array([0.98064312, 0.63303453, 0.82456065, 0.63424821, 0.81338589,
       0.75485666, 0.61511144, 0.88110521])

In [154]:
arr

array([[0.09804985, 0.98064312, 0.02512852, 0.63303453, 0.39451504],
       [0.46820709, 0.82456065, 0.39811887, 0.63424821, 0.81338589],
       [0.75485666, 0.12405724, 0.48094819, 0.36639965, 0.30594077],
       [0.1804678 , 0.23313354, 0.12520383, 0.61511144, 0.88110521]])

In [155]:
arr[[1,2], [2]]

array([0.39811887, 0.48094819])

In [156]:
arr = np.random.rand(8,5)

In [157]:
arr

array([[0.79619461, 0.34914879, 0.66412336, 0.24952903, 0.32091789],
       [0.39329531, 0.13319975, 0.72761435, 0.36390629, 0.61739262],
       [0.95062855, 0.2395421 , 0.21049243, 0.87876871, 0.76250154],
       [0.44773839, 0.87252424, 0.77617665, 0.99673162, 0.20654675],
       [0.17660961, 0.92751182, 0.54590097, 0.21656813, 0.31334446],
       [0.72889329, 0.83649514, 0.72704178, 0.34237115, 0.27797895],
       [0.96958355, 0.50170287, 0.19192827, 0.32770055, 0.75240802],
       [0.37340359, 0.76312141, 0.76843004, 0.47354388, 0.55154105]])

In [158]:
arr[1:8 , 0:3]

array([[0.39329531, 0.13319975, 0.72761435],
       [0.95062855, 0.2395421 , 0.21049243],
       [0.44773839, 0.87252424, 0.77617665],
       [0.17660961, 0.92751182, 0.54590097],
       [0.72889329, 0.83649514, 0.72704178],
       [0.96958355, 0.50170287, 0.19192827],
       [0.37340359, 0.76312141, 0.76843004]])

In [162]:
a2 = arr[1 : 8 , [0,1,2]]

In [163]:
a2

array([[0.39329531, 0.13319975, 0.72761435],
       [0.95062855, 0.2395421 , 0.21049243],
       [0.44773839, 0.87252424, 0.77617665],
       [0.17660961, 0.92751182, 0.54590097],
       [0.72889329, 0.83649514, 0.72704178],
       [0.96958355, 0.50170287, 0.19192827],
       [0.37340359, 0.76312141, 0.76843004]])

In [164]:
a2[0][0] = 100

In [165]:
a2

array([[100.        ,   0.13319975,   0.72761435],
       [  0.95062855,   0.2395421 ,   0.21049243],
       [  0.44773839,   0.87252424,   0.77617665],
       [  0.17660961,   0.92751182,   0.54590097],
       [  0.72889329,   0.83649514,   0.72704178],
       [  0.96958355,   0.50170287,   0.19192827],
       [  0.37340359,   0.76312141,   0.76843004]])

In [166]:
a =np.array([[1,2], [3,4]])
b =np.array([[2,3], [4,5]])

In [167]:
a

array([[1, 2],
       [3, 4]])

In [168]:
b

array([[2, 3],
       [4, 5]])

In [169]:
a*b

array([[ 2,  6],
       [12, 20]])

In [171]:
m=a@b

In [173]:
m/0

<ipython-input-173-be1849f03ef3>:1: RuntimeWarning: divide by zero encountered in true_divide
  m/0

array([[inf, inf],
       [inf, inf]])